"""
4) Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции.
"""

n = int(input("Введите число: "))
num = 0
while n > 0 :
    if n % 10 > num:
        num = n % 10
    n //= 10
print(num)
