"""
2) Пользователь вводит время в секундах. 
    Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс. 
    Используйте форматирование строк.
"""

s = int(input("Введите количество секунд: "))

hour = s // (60 * 60)
s %= (60 * 60)
min = s // 60
if min < 10: 
    min = str(F'0{min}')
s %= 60
if s < 10: 
    s = str(F'0{s}')
print("{}:{}:{}".format(hour, min, s))