"""
    5) Запросите у пользователя значения выручки и издержек фирмы. 
    Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки). 
    Выведите соответствующее сообщение. 
    
    Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке). 
    Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.
"""

revenue = int(input("Введите значение выручки: "))
cost = int(input("Введите значение издержек: "))
if cost > revenue:
    print("издержки больше выручки")

if revenue > cost:
    print("выручка больше издержек")
    print(f"рентабельность составила {revenue - cost}")
    workers = int(input("введите количество сотрудников"))
    print(f"прибыль фирмы в расчете на одного сотрудника составила {round((revenue - cost) / workers, 2)}")