"""
1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
и проверяет, является ли этот день выходным.
"""

n = int(input("Введите цифру, обозначающую день недели: "))

if n > 7:
    print("Вы ввели некорректную цифру")
if n == 7 or n == 6:
    print("День является выходным")
if n > 0 and n < 6:
    print("День является рабочим")