"""
1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
и проверяет, является ли этот день выходным.
"""

n = int(input("Введите цифру, обозначающую день недели: "))

if n > 7 or n < 1:
    print("Вы ввели некорректную цифру")
elif n in (6, 7):
    print("День является выходным")
else:
    print("День является рабочим")
    