"""
1) Создать класс TrafficLight (светофор) и определить у него один атрибут color
(цвет) и метод running (запуск). Атрибут реализовать как приватный. В рамках
метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
Продолжительность первого состояния (красный) составляет 7 секунд,
второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
Переключение между режимами должно осуществляться только в указанном порядке
(красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав
описанный метод. Задачу можно усложнить, реализовав проверку порядка режимов,
и при его нарушении выводить соответствующее сообщение и завершать скрипт.
"""

from time import sleep

class TrafficLight:
    """
    переключение сигналов светофора
    """
    __color = ('красный', 'желтый', 'зелёный')
    __delay = (7, 2, 5)

    def running(self):
        """
        метод переключения сигналов светофора
        """
        while True:
            print(self.__color[0])
            sleep(self.__delay[0])
            print(self.__color[1])
            sleep(self.__delay[1])
            print(self.__color[2])
            sleep(self.__delay[2])

tr = TrafficLight()
tr.running()
