"""
5) Реализовать класс Stationery (канцелярская принадлежность).
Определить в нем атрибут title (название) и метод draw (отрисовка).
Метод выводит сообщение “Запуск отрисовки.” Создать три дочерних класса
Pen (ручка), Pencil (карандаш), Handle (маркер).
В каждом из классов реализовать переопределение метода draw.
Для каждого из классов метод должен выводить уникальное сообщение.
Создать экземпляры классов и проверить, что выведет описанный метод для каждого
экземпляра.
"""

class Stationery:
    """класс канцелярская принадлежность"""
    def __init__(self, title):
        self.title = title

    def draw(self):
        """Метод выводит сообщение “Запуск отрисовки.”"""
        print('Запуск отрисовки.')

class Pen(Stationery):
    """подкласс Ручка"""
    def draw(self):
        """Метод выводит сообщение “Запуск отрисовки.”"""
        print('Мы пишем ручкой')

class Pencil(Stationery):
    """подкласс Карандаш"""
    def draw(self):
        """Метод выводит сообщение “Запуск отрисовки.”"""
        print('Мы рисуем карандашом')

class Handle(Stationery):
    """подкласс Маркер"""
    def draw(self):
        """Метод выводит сообщение “Запуск отрисовки.”"""
        print('Мы рисуем маркером')

first = Stationery('Линейка')
second = Pen('шариковая ручка')
third = Pencil('Простой карандаш')
fourth = Handle('спиртовой маркер')

print(first.title)
first.draw()

second.draw()
third.draw()
print(fourth.title)
fourth.draw()
