"""
2) Реализовать класс Road (дорога), в котором определить атрибуты:
length (длина), width (ширина). Значения данных атрибутов должны передаваться
при создании экземпляра класса. Атрибуты сделать защищенными. Определить метод
расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
Использовать формулу: длинаширинамасса асфальта для покрытия одного кв метра
дороги асфальтом, толщиной в 1 см*число см толщины полотна. Проверить работу
метода.
Например: 20м*5000м*25кг*5см = 12500 т
"""

class Road:
    """
    класс расчитывающий необходимое количество асфальта для укладки дорожного
    полотна определённой ширины и длины полученных в аргументах в метрах
    """
    thickness = 5 # толщина полотна, сантиметры
    consumption = 25 # расход асфальта на 1м2 толщиной 1см, кг

    def __init__(self, width, length):
        self._length = float(length)
        self._width = float(width)

    def payment(self):
        """
        метод расчета массы асфальта
        """

        print(f'{self._length}м * {self._width}м * {Road.consumption}кг * {Road.thickness}см ='
            f'{self._length * self._width * (Road.consumption / 1000) * (Road.thickness / 100)}т')

r = Road(20, 5000)
r.payment()
