"""
Реализовать функцию, принимающую несколько параметров, описывающих данные
пользователя: имя, фамилия, год рождения, город проживания, email, телефон.
Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.
"""

def my_func(name, surname, year, city, email, phone):
    """
    вывод полученных аргуметнов одной строкой
    """
    return f"{name} {surname} {year} {city} {email} {phone}"

res = my_func(
    name=input("Введите имя: "),
    surname=input("Введите фамилию: "),
    year=input("Введите год рождения: "),
    city=input("Введите город проживания: "),
    email=input("Введите email: "),
    phone=input("Введите телефон: ")
)

print(res)
