"""
Реализовать функцию, принимающую два числа (позиционные аргументы)
и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть
обработку ситуации деления на ноль.
"""

def my_div():
    """
    нахожнение частного от деления
    """
    try:
        dividend = int(input("Введите делимое: "))
        divider = int(input("Введите делитель: "))
        print(dividend / divider)

    except ValueError:
        print("Вы ввели некорректные данные")
        r = (input("Хотите повторить ввод данных? введите да: "))
        if r.lower() == 'да':
            return my_div()
        return
    except ZeroDivisionError:
        print("На ноль делить нельзя, это даже дети знают, но мы можем повторить запрос")
        r = (input("Хотите повторить ввод данных? введите да: "))
        if r.lower() == 'да':
            return my_div()
        return

my_div()
