"""
Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить
ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных
чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
специальный символ, выполнение программы завершается. Если специальный символ
введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к
полученной ранее сумме и после этого завершить программу.
"""
def my_sum(summ):
    """
    Программа запрашивает у пользователя строку чисел, разделенных пробелом.
    При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить
    ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных
    чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится
    специальный символ, выполнение программы завершается. Если специальный символ
    введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к
    полученной ранее сумме и после этого завершить программу.
    """
    arr = input("Введите числа через пробел или q для выхода: ").split()
    for i in arr:
        if i.lower() == 'q':
            print(summ)
            return summ
        summ += int(i)
    print(summ)
    my_sum(summ)

    return summ

my_sum(0)
