"""
6) *Реализовать структуру данных «Товары». Она должна представлять собой список
кортежей. Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: Название, Цена, Количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у
пользователя.
Пример готовой структуры:
[
(1, {"Название": "компьютер", "Цена": 20000, "Количество": 5, "eд": "шт."}),
(2, {"Название": "принтер", "Цена": 6000, "Количество": 2, "eд": "шт."}),
(3, {"Название": "сканер", "Цена": 2000, "Количество": 7, "eд": "шт."})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый
ключ — характеристика товара, например Название,
а значение — список значений-характеристик, например список названий товаров.
Пример:
{
"Название": ["компьютер", "принтер", "сканер"],
"Цена": [20000, 6000, 2000],
"Количество": [5, 2, 7],
"ед": ["шт."]
}
"""

my_lst = []
while True:
    my_lst.append((input("Номер товара: "),
                    {"Название": input("Название: "),
                    "Цена": input("Цена: "),
                    "Количество": input("Количество: "),
                    "eд": input("Единицы учёта: ")}))
    q = input("Закончить ввод позиций? даб нет: ")
    if q == "да":
        break

my_lst = [
(1, {"Название": "компьютер", "Цена": 20000, "Количество": 5, "eд": "шт."}),
(2, {"Название": "принтер", "Цена": 6000, "Количество": 2, "eд": "шт."}),
(3, {"Название": "сканер", "Цена": 2000, "Количество": 7, "eд": "шт."})
]

names_lst = []
prices_lst = []
counts_lst = []
units_lst = []
res_dict = {}

for i in range(len(my_lst)):
    names_lst.append(my_lst[i][1]['Название'])
    prices_lst.append(my_lst[i][1]['Цена'])
    counts_lst.append(my_lst[i][1]['Количество'])
    units_lst.append(my_lst[i][1]['eд'])

res_dict.update({'Названия': names_lst, 'Цены': prices_lst, 'Количество': counts_lst, 'единицы': units_lst})
print(res_dict)
