"""
    Пользователь вводит месяц в виде целого числа от 1 до 12.
    Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
    Напишите решения через list и через dict.
"""

SEASONS = ['зима', 'весна', 'лето', 'осень', 'зима']
mount = int(input("Введите месяц в виде числа от 1 до 12: "))
if mount < 1 or mount > 12:
    print("Вы ввели некорректное число")
else:
    print(f"Время года к которому относится ваш месяц(1) - {SEASONS[mount // 3]}")


SEASONS_DICT = {
    1: 'зима',
    2: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень',
    12: 'зима',
}

print(f"Время года к которому относится ваш месяц(2) - {SEASONS_DICT.get(mount)}")
