"""
Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""

arr = input("Введите предложение: ").split()
for i, w in enumerate(arr):
    print(f"{i + 1} {w[:10]}")
