"""
Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль.
Проверьте его работу на данных, вводимых пользователем. При вводе пользователем
нуля в качестве делителя программа должна корректно обработать эту ситуацию и
не завершиться с ошибкой.
"""

class MyError(Exception):
    """Выбрасывание исключения и текста исключения при ошибке"""
    def __init__(self, text):
        self.txt = text


div1 = float(input("Введите делимое: "))
div2 = float(input("Введите делитель: "))

try:
    if div2 == 0:
        raise MyError("Вы пытаетесь поделить на 0, одумайтесь!)")
    div = div1 / div2

except ValueError:
    print("Вы ввели не число")
except MyError as err:
    print(err)
else:
    print(f"{div1} / {div2} = {div}")
    