"""Реализовать класс Matrix (матрица).
Обеспечить перегрузку конструктора класса (метод init()),
который должен принимать данные (список списков) для формирования матрицы.
[[], [], []]
Следующий шаг — реализовать перегрузку метода str() для вывода матрицы
в привычном виде.

Далее реализовать перегрузку метода add() для реализации операции
сложения двух объектов класса Matrix (двух матриц).
Результатом сложения должна быть новая матрица.

Подсказка: сложение элементов матриц выполнять поэлементно —
первый элемент первой строки первой матрицы складываем
с первым элементом первой строки второй матрицы и т.д.

Пример:
1 2 3
4 5 6
7 8 9

1 2 3
4 5 6
7 8 9

Сумма матриц:
2 4 6
8 10 12
14 16 18
"""

class Matrix:
    """class Matrix"""
    def __init__(self, lists):
        self.list = lists

    def __str__(self):
        return str('\n'.join(str(row) for row in self.list))

    def __add__(self, other):

        # new_matrix = [[][]]
        return (self.list[0],other.list[0])
        # _new_matrix = []
        # for i in len(self.list[0]):
        #     for j in i:
        #         _new_matrix[i][j] = int(self.list[i][j]) + int(other.list[i][j])
        # return _new_matrix




a = Matrix([[1,2,3],[4,5,6],[7,8,9]])
b = Matrix([[10,20,30],[40,50,60],[70,80,90]])
print(a + b)
# print(b)
