"""
Реализовать скрипт, в котором должна быть предусмотрена функция расчета
заработной платы сотрудника. В расчете необходимо использовать формулу:
(выработка в часах*ставка в час) + премия. Для выполнения расчета для
конкретных значений необходимо запускать скрипт с параметрами.
"""

def calculation_salary(hours, rate, premium = 0):
    """
    функция расчета заработной платы сотрудника

    """
    return hours * rate + premium

print(calculation_salary(hours=int(input("выработка в часах: ")),
                        rate=int(input("ставка в час: ")),
                        premium=int(input("премия: "))))
                        