"""
Реализовать генератор с помощью функции с ключевым словом yield,
создающим очередное значение.
При вызове функции должен создаваться объект-генератор.
Функция должна вызываться следующим образом: for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо выводить
только первые n чисел, начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n. Например,
факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""

def fact(n):
    """
    функция нахождения факториала через рекурсию
    """
    try:
        if n < 0:
            print("вы ввели не корректное число")
            yield None
        if n in (0, 1):
            yield 1
        yield n * fact(n - 1)
    except ValueError:
        print("Вы ввели некорректные данные")
        r = (input("Хотите повторить ввод данных? введите да: "))
        if r.lower() == 'да':
            return fact(int(input("Введите число: ")))
print(fact(int(input("Введите число: "))))
